fredcooke/FreeScale-s12x-binutils/bfd/elf32-mc9s12x.c
static reloc_howto_type *
bfd_elf32_bfd_reloc_type_lookup (bfd *abfd ATTRIBUTE_UNUSED,
                                 bfd_reloc_code_real_type code)
{
  //printf("\n in bfd_elf32_bfd_reloc_type_lookup--line 398\n");
  unsigned int i;

  for (i = 0;
       i < sizeof (mc9s12x_reloc_map) / sizeof (struct mc9s12x_reloc_map);
       i++)
    {
      if (mc9s12x_reloc_map[i].bfd_reloc_val == code)
	return &elf_mc9s12x_howto_table[mc9s12x_reloc_map[i].elf_reloc_val];
    }

  return NULL;
}

static reloc_howto_type *
bfd_elf32_bfd_reloc_name_lookup (bfd *abfd ATTRIBUTE_UNUSED,
				 const char *r_name)
{
  //printf("\n in bfd_elf32_bfd_reloc_name_lookup--line 416\n");
  unsigned int i;

  for (i = 0;
       i < (sizeof (elf_mc9s12x_howto_table)
	    / sizeof (elf_mc9s12x_howto_table[0]));
       i++)
    if (elf_mc9s12x_howto_table[i].name != NULL
	&& strcasecmp (elf_mc9s12x_howto_table[i].name, r_name) == 0)
      return &elf_mc9s12x_howto_table[i];

  return NULL;
}

/* Set the howto pointer for an M68HC11 ELF reloc.  */

static void
mc9s12x_info_to_howto_rel (bfd *abfd ATTRIBUTE_UNUSED,
                           arelent *cache_ptr, Elf_Internal_Rela *dst)
{
  unsigned int r_type;

  r_type = ELF32_R_TYPE (dst->r_info);
  BFD_ASSERT (r_type < (unsigned int) R_MC9S12X_max);
  cache_ptr->howto = &elf_mc9s12x_howto_table[r_type];
}


/* Far trampoline generation.  */

/* Build a 68HC12 trampoline stub.  */
static bfd_boolean
mc9s12x_elf_build_one_stub (struct bfd_hash_entry *gen_entry, void *in_arg)
{
  struct elf32_mc9s12x_stub_hash_entry *stub_entry;
  struct bfd_link_info *info;
  struct mc9s12x_elf_link_hash_table *htab;
  asection *stub_sec;
  bfd *stub_bfd;
  bfd_byte *loc;
  bfd_vma sym_value, phys_page, phys_addr;

  /* Massage our args to the form they really have.  */
  stub_entry = (struct elf32_mc9s12x_stub_hash_entry *) gen_entry;
  info = (struct bfd_link_info *) in_arg;

  htab = mc9s12x_elf_hash_table (info);

  stub_sec = stub_entry->stub_sec;

  /* Make a note of the offset within the stubs for this entry.  */
  stub_entry->stub_offset = stub_sec->size;
  stub_sec->size += 7;
  loc = stub_sec->contents + stub_entry->stub_offset;

  stub_bfd = stub_sec->owner;

  /* Create the trampoline call stub:

     ldy #%addr(symbol)
     call %page(symbol), __trampoline

  */
  sym_value = (stub_entry->target_value
               + stub_entry->target_section->output_offset
               + stub_entry->target_section->output_section->vma);
  phys_addr = mc9s12x_phys_addr (&htab->pinfo, sym_value);
  phys_page = mc9s12x_phys_page (&htab->pinfo, sym_value);

  /* ldy #%page(sym) */
  bfd_put_8 (stub_bfd, 0xCD, loc);
  bfd_put_16 (stub_bfd, phys_addr, loc + 1);
  loc += 3;

  /* call %page(sym), __trampoline  */
  bfd_put_8 (stub_bfd, 0x4a, loc);
  bfd_put_16 (stub_bfd, htab->pinfo.trampoline_addr, loc + 1);
  bfd_put_8 (stub_bfd, phys_page, loc + 3);

  return TRUE;
}

/* As above, but don't actually build the stub.  Just bump offset so
   we know stub section sizes.  */

static bfd_boolean
mc9s12x_elf_size_one_stub (struct bfd_hash_entry *gen_entry,
                           void *in_arg ATTRIBUTE_UNUSED)
{
  struct elf32_mc9s12x_stub_hash_entry *stub_entry;

  /* Massage our args to the form they really have.  */
  stub_entry = (struct elf32_mc9s12x_stub_hash_entry *) gen_entry;

  stub_entry->stub_sec->size += 7;
  return TRUE;
}

/* Create a 68HC12 ELF linker hash table.  */

static struct bfd_link_hash_table *
mc9s12x_elf_bfd_link_hash_table_create (bfd *abfd)
{
  struct mc9s12x_elf_link_hash_table *ret;

  ret = mc9s12x_elf_hash_table_create (abfd);
  if (ret == (struct mc9s12x_elf_link_hash_table *) NULL)
    return NULL;

  ret->size_one_stub = mc9s12x_elf_size_one_stub;
  ret->build_one_stub = mc9s12x_elf_build_one_stub;

  return &ret->root.root;
}

static bfd_boolean
mc9s12x_elf_set_mach_from_flags (bfd *abfd)
{
  flagword flags = elf_elfheader (abfd)->e_flags;

  switch (flags & EF_MC9S12X_MACH_MASK)
    {
    case EF_MC9S12X_MACH:
      bfd_default_set_arch_mach (abfd, bfd_arch_mc9s12x, bfd_mach_mc9s12x);
      /* TODO bfd_mach_mc9s12x does not work as a parameter(0 instead) re-make headers maybe....
       * UPDATE SEEMS TO WORK NOW */


   // 	 bfd_default_set_arch_mach (abfd, bfd_arch_m68hc12, bfd_mach_m6812s);  /* for testing */
      break;
 //   case EF_MC9S12X_MACH:
 //     bfd_default_set_arch_mach (abfd, bfd_arch_mc9s12x, bfd_mach_mc9s12x);
 //     break;
 //   case EF_MC9S12X_GENERIC:
 //    bfd_default_set_arch_mach (abfd, bfd_arch_mc9s12x,
 //                                bfd_mach_mc9s12x_default);
 //     break;
    default:
      return FALSE;
    }
  return TRUE;
}

/* Specific sections:
   - The .page0 is a data section that is mapped in [0x0000..0x00FF].
     Page0 accesses are faster on the M68HC12.
   - The .vectors is the section that represents the interrupt
     vectors.  */
static const struct bfd_elf_special_section elf32_mc9s12x_special_sections[] =
{
  { STRING_COMMA_LEN (".eeprom"),   0, SHT_PROGBITS, SHF_ALLOC + SHF_WRITE },
  { STRING_COMMA_LEN (".page0"),    0, SHT_PROGBITS, SHF_ALLOC + SHF_WRITE },
  { STRING_COMMA_LEN (".softregs"), 0, SHT_NOBITS,   SHF_ALLOC + SHF_WRITE },
  { STRING_COMMA_LEN (".vectors"),  0, SHT_PROGBITS, SHF_ALLOC },
  { NULL,                       0,  0, 0,            0 }
};

#define ELF_ARCH		bfd_arch_mc9s12x
#define ELF_MACHINE_CODE	EM_MC9S12X

//#define ELF_MACHINE_CODE	EM_68HC12 /* testing value */
#define ELF_MAXPAGESIZE		0x1000

#define TARGET_BIG_SYM          bfd_elf32_mc9s12x_vec
#define TARGET_BIG_NAME		"elf32-mc9s12x"

#define elf_info_to_howto	0
#define elf_info_to_howto_rel	     mc9s12x_info_to_howto_rel  /* TODO figure out why this has to be here */
#define elf_backend_check_relocs     elf32_mc9s12x_check_relocs
#define elf_backend_relocate_section elf32_mc9s12x_relocate_section
#define elf_backend_object_p		mc9s12x_elf_set_mach_from_flags
#define elf_backend_final_write_processing	0
#define elf_backend_can_gc_sections		1
#define elf_backend_special_sections elf32_mc9s12x_special_sections
#define elf_backend_post_process_headers     elf32_mc9s12x_post_process_headers
#define elf_backend_add_symbol_hook  elf32_mc9s12x_add_symbol_hook

#define bfd_elf32_bfd_link_hash_table_create \
		mc9s12x_elf_bfd_link_hash_table_create
#define bfd_elf32_bfd_link_hash_table_free \
		mc9s12x_elf_bfd_link_hash_table_free
#define bfd_elf32_bfd_merge_private_bfd_data \
					_bfd_mc9s12x_elf_merge_private_bfd_data
#define bfd_elf32_bfd_set_private_flags	_bfd_mc9s12x_elf_set_private_flags
#define bfd_elf32_bfd_print_private_bfd_data \
					_bfd_mc9s12x_elf_print_private_bfd_data

#include "elf32-target.h"
/* TODO
 * I dont think you can.
 *  make sure commenting out the above is OK  the elf32-target file ends up in the build directory*/

/* ############################################################################################################################################
 * included from hc1x.c ??????

 Motorola 68HC11/HC12-specific support for 32-bit ELF
   Copyright 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
   2009 Free Software Foundation, Inc.
   Contributed by Stephane Carrez (stcarrez@nerim.fr)

   This file is part of BFD, the Binary File Descriptor library.

