fredcooke/FreeScale-s12x-binutils/bfd/elf32-mc9s12x.c
  new_flags &= ~(EF_M68HC11_ABI | EF_M68HC11_MACH_MASK);
  old_flags &= ~(EF_M68HC11_ABI | EF_M68HC11_MACH_MASK);
 */


  /* Processor compatibility.  */
  /* TODO eliminate compat mode mabye have a mode MUST BE REFACTORED */
//  if (!EF_MC9S12X_CAN_MERGE_MACH (new_flags, old_flags))
//    {
//      (*_bfd_error_handler)
//	(_("%B: linking files compiled for HCS12 with "
//           "others compiled for HC12"), ibfd);
      ok = FALSE;
//    }
//  new_flags = ((new_flags & ~EF_MC9S12X_MACH_MASK)
//               | (EF_MC9S12X_MERGE_MACH (new_flags, old_flags)));

  elf_elfheader (obfd)->e_flags = new_flags;

  new_flags &= ~(EF_MC9S12X_ABI | EF_MC9S12X_MACH_MASK);
  old_flags &= ~(EF_MC9S12X_ABI | EF_MC9S12X_MACH_MASK);

  /* Warn about any other mismatches */
  if (new_flags != old_flags)
    {
      (*_bfd_error_handler)
	(_("%B: uses different e_flags (0x%lx) fields than previous modules (0x%lx)"),
	 ibfd, (unsigned long) new_flags, (unsigned long) old_flags);
      ok = FALSE;
    }

  if (! ok)
    {
      bfd_set_error (bfd_error_bad_value);
      return FALSE;
    }

  return TRUE;
}

bfd_boolean
_bfd_mc9s12x_elf_print_private_bfd_data (bfd *abfd, void *ptr)
{
  FILE *file = (FILE *) ptr;

  BFD_ASSERT (abfd != NULL && ptr != NULL);

  /* Print normal ELF private data.  */
  _bfd_elf_print_private_bfd_data (abfd, ptr);

  /* xgettext:c-format */
  fprintf (file, _("private flags = %lx:"), elf_elfheader (abfd)->e_flags);

  if (elf_elfheader (abfd)->e_flags & E_MC9S12X_I32)
    fprintf (file, _("[abi=32-bit int, "));
  else
    fprintf (file, _("[abi=16-bit int, "));

  if (elf_elfheader (abfd)->e_flags & E_MC9S12X_F64)
    fprintf (file, _("64-bit double, "));
  else
    fprintf (file, _("32-bit double, "));
/* TODO reduce to 1 target */
  if (strcmp (bfd_get_target (abfd), "elf32-mc9s12X") == 0)
    fprintf (file, _("cpu=MC9S12X]"));
  else if (elf_elfheader (abfd)->e_flags & EF_MC9S12X_MACH)
    fprintf (file, _("cpu=MC9S12X]"));
  else
    fprintf (file, _("cpu=MC9S12X]"));

  if (elf_elfheader (abfd)->e_flags & E_MC9S12X_BANKS)
    fprintf (file, _(" [memory=bank-model]"));
  else
    fprintf (file, _(" [memory=flat]"));

  fputc ('\n', file);

  return TRUE;
}

static void scan_sections_for_abi (bfd *abfd ATTRIBUTE_UNUSED,
                                   asection *asect, void *arg)
{
  struct mc9s12x_scan_param* p = (struct mc9s12x_scan_param*) arg;

  if (asect->vma >= p->pinfo->bank_virtual)
    p->use_memory_banks = TRUE;
}

/* Tweak the OSABI field of the elf header.  */

void
elf32_mc9s12x_post_process_headers (bfd *abfd, struct bfd_link_info *link_info)
{
  struct mc9s12x_scan_param param;

  if (link_info == 0)
    return;

  mc9s12x_elf_get_bank_parameters (link_info);

  param.use_memory_banks = FALSE;
  param.pinfo = &mc9s12x_elf_hash_table (link_info)->pinfo;
  bfd_map_over_sections (abfd, scan_sections_for_abi, &param);
  if (param.use_memory_banks)
    {
      Elf_Internal_Ehdr * i_ehdrp;

      i_ehdrp = elf_elfheader (abfd);
      i_ehdrp->e_flags |= E_MC9S12X_BANKS;
    }
}

